Documents/ЗакрытиеАктаТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗакрытиеАктаТП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакрытиеПоСотрудникам</xr:Item>
				<xr:Item>AccumulationRegister.ПланТиражныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТирАиП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АктТиражногоПодразделения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НастройкиФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФизическогоЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРабочая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТирАиП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТирАиП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗакрытиеАктаТП/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПодразделениеАкта( АктТиражногоПодразделения)
	Возврат АктТиражногоПодразделения.Подразделение;
КонецФункции

&НаСервере
Процедура УстановитьДатуНовогоДокументаПоПользователю( Объект )
	Если НЕ ЗначениеЗаполнено( Объект.Ссылка ) Тогда
		ФизическоеЛицо = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		Если ЗначениеЗаполнено( ФизическоеЛицо ) Тогда
			МенЗаписи = РегистрыСведений.НастройкиФизическогоЛица.СоздатьМенеджерЗаписи();
			МенЗаписи.ФизическоеЛицо = ФизическоеЛицо;
			МенЗаписи.Прочитать();
			Если ЗначениеЗаполнено( МенЗаписи.ДатаРабочая ) Тогда
				Объект.Дата = МенЗаписи.ДатаРабочая;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ПриИзмененииАкта_НаСервере()
	МоментВремени = ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Ссылка.МоментВремени()) ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАктовОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТирАиП.Остатки(&МоментВремени, Источник = &Акт) КАК ОстаткиАктовОстатки";

	Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени);
	Запрос.УстановитьПараметр("Акт", 			Объект.АктТиражногоПодразделения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ОстатокАкта = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокАкта = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура АктТиражногоПодразделенияПриИзменении(Элемент)
	ПриИзмененииАкта_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииАкта_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДатуНовогоДокументаПоПользователю( Объект );
КонецПроцедуры


// максимальная цена номенклатуры
&НаСервереБезКонтекста
Функция ПолучитьМаксЦенуИзПланаРабот( АктТиражногоПодразделения, Номенклатура )
	СтЦен = Новый Структура;
	тзЦены = УП_ПланыРаботПоПроектам.ПолучитьЦеныНоменклатурыИзПланаРабот( АктТиражногоПодразделения.ПланРабот, Номенклатура );
	Если тзЦены.Количество() <> 0 Тогда
		СтЦен.Вставить("Цена", 		тзЦены[0].Цена);
		СтЦен.Вставить("ЦенаФОТ", 	тзЦены[0].ЦенаФОТ);
	Иначе
		СтЦен.Вставить("Цена", 		0);
		СтЦен.Вставить("ЦенаФОТ", 	0);
	КонецЕсли;
	Возврат СтЦен;
КонецФункции

&НаКлиенте
Процедура ПересчетСуммПоСтроке( Стр )
	Стр.Сумма = Стр.Количество * Стр.Цена - Стр.Скидка;
	// пропорция цены
	Если Стр.Цена <> 0 Тогда
		К = Стр.Сумма/Стр.Цена;
		// пересчет суммы
		Стр.СуммаФОТ 	= К * Стр.ЦенаФОТ;
	Иначе
		Стр.СуммаФОТ 	= Стр.Количество  * Стр.ЦенаФОТ;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция мНоменклатуры( АктТиражногоПодразделения )
	Возврат УП_ПланыРаботПоПроектам.МассивНоменклатурыИзПланаРаботТиражного( АктТиражногоПодразделения.ПланРабот);
КонецФункции

&НаСервереБезКонтекста
Функция мЦен( АктТиражногоПорадразделения, Номенклатура, НазваниеЦены )
	тзЦены 	= УП_ПланыРаботПоПроектам.ПолучитьЦеныНоменклатурыИзПланаРабот( АктТиражногоПорадразделения.ПланРабот, Номенклатура );
	мЦен	=  тзЦены.ВыгрузитьКолонку( НазваниеЦены );
	Возврат мЦен;
КонецФункции

&НаКлиенте
Процедура ФизическиеЛицаНоменклатураПриИзменении(Элемент)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
	
		СтЦен 		= ПолучитьМаксЦенуИзПланаРабот( Объект.АктТиражногоПодразделения, Стр.Номенклатура );
		Стр.ЦенаФОТ = СтЦен.ЦенаФОТ;
		Стр.Цена    = СтЦен.Цена;	
		
	Иначе
		Стр.ЦенаФОТ = 0;
		Стр.Цена    = 0;	
	КонецЕсли;
	ПересчетСуммПоСтроке( Стр );
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мНоменклатуры = мНоменклатуры( Объект.АктТиражногоПодразделения );
	Если мНоменклатуры <>  Неопределено Тогда
		ЭтаФорма.Элементы.ФизическиеЛицаНоменклатура.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ФизическиеЛицаНоменклатура.СписокВыбора.ЗагрузитьЗначения(мНоменклатуры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаЦенаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	мЦен  = мЦен( Объект.АктТиражногоПодразделения,  Стр.Номенклатура, "Цена" );
	Если мЦен <>  Неопределено Тогда
		ЭтаФорма.Элементы.ФизическиеЛицаЦена.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ФизическиеЛицаЦена.СписокВыбора.ЗагрузитьЗначения(мЦен);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПриИзменении(Элемент)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	ПересчетСуммПоСтроке( Стр );
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаЦенаФОТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	мЦен  = мЦен( Объект.АктТиражногоПодразделения,  Стр.Номенклатура, "ЦенаФОТ" );
	Если мЦен <>  Неопределено Тогда
		ЭтаФорма.Элементы.ФизическиеЛицаЦенаФОТ.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ФизическиеЛицаЦенаФОТ.СписокВыбора.ЗагрузитьЗначения(мЦен);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаКоличествоПриИзменении(Элемент)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	ПересчетСуммПоСтроке( Стр );
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаЦенаПриИзменении(Элемент)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	ПересчетСуммПоСтроке( Стр );
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаЦенаФОТПриИзменении(Элемент)
	Стр = Элементы.ФизическиеЛица.ТекущиеДанные;
	ПересчетСуммПоСтроке( Стр );
	// Вставить содержимое обработчика.
КонецПроцедуры
